/* База данных «Прокат автомобилей */

-- Заполнение таблиц начальным набором данных
print(N'*** Старт скрипта заполнения таблиц базы данных ***');


-- бренды автомобилей
print(N'    Заполнение таблицы справочника БРЕНДЫ');
-- названия брендов
-- данные из http://www.rentacar-donetsk.com.ua/katalog_avto.html
insert into Brands 
    ([Name])
values
    ('VAZ'),        --  1
	('Skoda'),      --  2
	('Suzuki'),     --  3
	('Toyota'),     --  4
	('Tesla'),      --  5
	('Mercedes'),   --  6
	('Lanos'),      --  7
	('Volkswagen'), --  8
	('Ford'),       --  9
	('Audi');       -- 10
go
print('    OK' + char(13));
go


-- модели автомобилей
print(N'    Заполнение таблицы справочника МОДЕЛИ');
-- названия моделей автомобилей
-- данные из http://www.rentacar-donetsk.com.ua/katalog_avto.html
insert into Models 
    ([Name])
values
    ('Fabia New'),     --  1
	('Roomster'),      --  2
	('Polo'),          --  3
	('Octavia Tour'),  --  4
	('Octavia A5'),    --  5
	('Grand Vitara'),  --  6
	('Camry'),         --  7
	('EOS'),           --  8
	('210'),           --  9
	('8 Quatro');      -- 10
go
print('    OK' + char(13));
go

-- названия улиц
print(N'    Заполнение таблицы справочника НАЗВАНИЯ УЛИЦ');
insert into Streets ([Name])
values
    (N'ул. Садовая'),      --  1
	(N'пр. Измайлова'),    --  2
	(N'ул. Воинская'),     --  3
	(N'ул. Столичная'),    --  4
	(N'ул. Ореховая'),     --  5
	(N'пр. Радио'),        --  6
	(N'ул. Павлова'),      --  7
	(N'пр. Королева'),     --  8
	(N'пр. Николаевский'), --  9
	(N'ул. Прокатчиков'),  -- 10
	(N'пр. Мира');         -- 11
print('    OK' + char(13));
go

-- цвета
print(N'    Заполнение таблицы справочника ЦВЕТА');
-- названия цветов автомобилей - Colors
-- https://amastercar.ru/handbook/handbook_auto_7.shtml
insert into Colors 
    ([Name])
values
    (N'белый'),          --  1
	(N'серебристый'),    --  2
	(N'красный'),        --  3
	(N'фиолетовый'),     --  4
	(N'бело-желтый'),    --  5
	(N'желтый'),         --  6
	(N'светло-желтый'),  --  7
	(N'светло-зеленый'), --  8
	(N'сливочно-белый'), --  9
	(N'зеленый');        -- 10
go
print('    OK' + char(13));
go


-- автомобили прокатной фирмы
print(N'    Заполнение таблицы справочника АВТОМОБИЛИ');
insert into Cars
    (IdBrand, IdModel, IdColor, Plate, YearManuf, InsurValue, Rental)
values 
    (2, 4, 5, N'С167РК', 2018, 3300000, 5600),  --  1
    (3, 6, 7, N'Т306РК', 2018, 4100000, 6100),  --  2
    (2, 4, 5, N'С168РК', 2016, 3300000, 5500),  --  3
    (3, 6, 7, N'Т312РК', 2018, 4100000, 6000),  --  4
    (3, 6, 5, N'О169РК', 2016, 4300000, 6100),  --  5
    (2, 5, 4, N'Н177РК', 2015, 2800000, 2600),  --  6
    (2, 4, 5, N'С170РК', 2018, 3200000, 5600),  --  7
    (3, 6, 7, N'Т315РК', 2018, 4100000, 5900),  --  8
    (2, 4, 5, N'С201РК', 2018, 3300000, 5500),  --  9
    (2, 5, 4, N'Н176РК', 2015, 2800000, 2500),  -- 10
    (2, 5, 4, N'Н179РК', 2015, 2700000, 2700),  -- 11
    (3, 6, 2, N'В012РК', 2016, 4100000, 6100),  -- 12
    (3, 6, 2, N'В015РК', 2018, 4200000, 6200),  -- 13
    (2, 4, 5, N'С212РК', 2016, 3100000, 5400),  -- 14
    (2, 5, 7, N'Т397РК', 2020, 2800000, 2800),  -- 15
    (2, 5, 4, N'Н175РК', 2020, 2800000, 2700),  -- 16
    (2, 4, 5, N'С192РК', 2016, 3100000, 5600),  -- 17
    (4, 7, 7, N'Т317РК', 2020, 2900000, 2900),  -- 18
	(3, 6, 5, N'В019РК', 2018, 4000000, 6000);  -- 19
print('    OK' + char(13));
go


-- клиенты прокатной фирмы
print(N'    Заполнение таблицы справочника КЛИЕНТЫ');
insert into Clients
    (Surname, [Name], Patronymic, Passport, IdStreet, Building, Flat)
values
    (N'Юрковский',   N'Марк',      N'Максимилианович', '12 21 345671', 1, N'6',         12),  --  1
	(N'Якубовская',  N'Диана',     N'Павловна',        '12 21 123452', 3, N'5',         89),  --  2
    (N'Шапиро',      N'Федор',     N'Федорович',       '12 21 456123', 1, N'6',        113),  --  3
	(N'Вожжаев',     N'Сергей',    N'Денисович',       '12 21 123122', 6, N'12',         7),  --  4
    (N'Хроменко',    N'Игорь',     N'Владимирович',    '12 21 342121', 2, N'456',       19),  --  5
	(N'Пелых',       N'Марина',    N'Ульяновна',       '11 21 121212', 1, N'7',          3),  --  6
	(N'Лапотникова', N'Тамара',    N'Оскаровна',       '11 21 098181', 8, N'8а',        12),  --  7
	(N'Огородников', N'Сергей',    N'Иванович',        '12 21 091911', 3, N'5',         32),  --  8
    (N'Яйло',        N'Екатерина', N'Николаевна',      '12 21 345675', 6, N'12',        17),  --  9
	(N'Лосева',      N'Инна',      N'Степановна',      '12 21 187651', 7, N'34',        76),  -- 10
    (N'Михайлович',  N'Анна',      N'Валентиновна',    '09 20 000122', 7, N'34-бис',     6),  -- 11
	(N'Тарапата',    N'Михаил',    N'Исаакович',       '09 20 001981', 3, N'16',        12),  -- 12
	(N'Трубихин',    N'Эдуард',    N'Михайлович',      '09 21 121921', 8, N'212',       55),  -- 13
	(N'Чмыхало',     N'Олег',      N'Тарасович',       '12 20 021121', 6, N'111',       34),  -- 14
	(N'Князьков',    N'Степан',    N'Сидорович',       '09 19 002165', 8, N'212',       71),  -- 15
	(N'Потемкина',   N'Наталья',   N'Павловна',        '09 19 002213', 7, N'121',        1),  -- 16
    (N'Гритченко',   N'Степан',    N'Романович',       '09 19 002129', 5, N'78',        87),  -- 17
	(N'Селиванов',   N'Александр', N'Михайлович',      '11 18 000503', 5, N'78',        19),  -- 18
	(N'Царькова',    N'Лариса',    N'Ильинична',       '11 18 000523', 5, N'89',         5),  -- 19
	(N'Яструб',      N'Владимир',  N'Данилович',       '14 21 091811', 4, N'57',       142),  -- 20
    (N'Мелашенко',   N'Александр', N'Алексеевич',      '14 21 345675', 3, N'3',         11),  -- 21
	(N'Пономаренко', N'Владислов', N'Дмитриевич',      '13 21 185659', 4, N'42',        24),  -- 22 
	(N'Хавалджи',    N'Любовь',    N'Амировна',        '13 20 000112', 6, N'89',        11),  -- 23
	(N'Пархоменко',  N'Ирина',     N'Владимировна',    '08 20 001781', 1, N'5 корп. 2', 83),  -- 24
    (N'Демидова',    N'Алина',     N'Александровна',   '08 21 126921', 2, N'212',       17),  -- 25
	(N'Лысенко',     N'Елена',     N'Егоровна',        '18 20 061121', 4, N'57г',       38),  -- 26
	(N'Федосенко',   N'Оксана',    N'Владимировна',    '08 19 402165', 1, N'9д',       122),  -- 27
	(N'Богатырева',  N'Екатерина', N'Алексеевна',      '08 19 032213', 3, N'2',         54),  -- 28
	(N'Иванова',     N'Валентина', N'Степановна',      '14 19 003129', 1, N'9',        121),  -- 29
	(N'Ильюшин',     N'Сергей',    N'Юрьевич',         '13 18 000603', 3, N'2',         72);  -- 30
print('    OK' + char(13));
go


-- факты прокатов автомомбилей
print(N'    Заполнение таблицы регистра ФАКТЫ_ПРОКАТА');
insert into Hires
    (IdClient, IdCar, DateStart, Duration)
values
    (13,  1, '2024-01-01', 15), --  1
	( 1,  5, '2024-01-01',  6), --  2
    (15,  8, '2024-01-03',  5), --  3
    (11, 10, '2024-01-03',  9), --  4
    ( 9,  9, '2024-01-04', 12), --  5
    ( 6,  3, '2024-01-05', 12), --  6
    ( 7,  2, '2024-01-11', 13), --  7
    ( 8, 19, '2024-01-20',  6), --  8
    (12, 11, '2024-02-01',  8), --  9
    (16,  1, '2024-02-03',  3), -- 10
	(19,  2, '2024-02-04',  2), -- 11
	( 3,  8, '2024-02-06', 10), -- 12
	( 5,  3, '2024-02-22',  4), -- 13
	( 2,  9, '2024-02-23', 15), -- 14
	(17,  1, '2024-02-23',  3), -- 15
	(10,  7, '2024-05-01', 13), -- 16
	( 4,  2, '2024-03-01',  6), -- 17
	(14,  5, '2024-03-01',  7), -- 18
	(20, 11, '2024-03-02', 15), -- 19
	(18,  4, '2024-03-02',  7); -- 20
go
print('    OK' + char(13));
go

print(N'*** Финиш скрипта заполнения таблиц базы данных ***');
